{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Designing a Pipeline"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "To get setup install the recommended packages from the `requirements.txt` file. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install -r requirements.txt"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Refer to the book to cover the chapters on getting the data ingested into the Neo4J instance. This will focus on the Python elements of the process. "
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Simulating customer interactions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from faker import Faker\n",
    "\n",
    "fake = Faker()\n",
    "Faker.seed(0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Norma Fisher\n",
      "4759 William Haven Apt. 194\n",
      "West Corey, CA 90152\n"
     ]
    }
   ],
   "source": [
    "name = fake.name()\n",
    "address = fake.address()\n",
    "\n",
    "print(name)\n",
    "print(address)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Here we will create a custom class to create some fake information based on the customerID. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "\n",
    "class Customer:\n",
    "\tdef __init__(self, customerID):\n",
    "\t\tself.customerID = customerID\n",
    "\t\tself.name = fake.name()\n",
    "\t\tself.address = fake.address()\n",
    "\t\tself.datetime = datetime.now().strftime(\"%d/%m/%Y-%H:%M:%S\")\n",
    "\n",
    "\t# Custom string override (dunder method) to print when print on new customer class is instantiated\n",
    "\tdef __str__(self):\n",
    "\t\treturn f'The customer ID is: {self.customerID}\\nCustoner Name is: {self.name}\\nCustomer address: {self.address}\\nCreated on: {self.datetime}'\n",
    "   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The customer ID is: 9999\n",
      "Custoner Name is: Justin Gomez\n",
      "Customer address: 778 Brown Plaza\n",
      "North Jenniferfurt, VT 88077\n",
      "Created on: 19/10/2023-16:30:11\n"
     ]
    }
   ],
   "source": [
    "new_customer = Customer(customerID=9999)\n",
    "print(new_customer)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create connection to Neo4J instance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "class Neo4jConnect:\n",
    "\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "        \n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "        \n",
    "    def query(self, query):\n",
    "        session = self.driver.session()\n",
    "        result = session.run(query)\n",
    "        return result\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For convenience - this has also been saved into the supporting package we have created. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphtastic.database.neo4j import Neo4jConnect"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Next we will add customers to our Neo4J instance using the faked data:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_customer(c, connection):\n",
    "    query = f'MERGE (:Customer {{customerID: toInteger({c.customerID}), ' \\\n",
    "    \t\tf'name: \"{c.name}\", ' \\\n",
    "    \t\tf'address: \"{c.address}\"}})'\n",
    "    connection.query(query)\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Test this function out with our faked data. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "test_customer = Customer(9999)\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "add_customer(test_customer, connection)\n",
    "connection.close()"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Run this code in Neo4J Browser:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Overwriting cypher/return_customers.cql\n"
     ]
    }
   ],
   "source": [
    "%%writefile cypher/return_customers.cql\n",
    "MATCH (c:Customer) RETURN c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_purchase(c, productID, time, connection):\n",
    "\tquery = f'MATCH (c:Customer {{customerID: toInteger({c.customerID})}}) ' \\\n",
    "\t\t\tf'MATCH (p:Product {{productID: toInteger({productID})}}) ' \\\n",
    "\t\t\tf'MERGE (c)-[:PURCHASED {{datetime:\"{time}\"}}]->(p)'\n",
    "\tconnection.query(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "add_purchase(test_customer, 1010, datetime.now(), connection)\n",
    "connection.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Overwriting cypher/edge_bt_cust_and_purch_nodes.cql\n"
     ]
    }
   ],
   "source": [
    "%%writefile cypher/edge_bt_cust_and_purch_nodes.cql\n",
    "MATCH (c:Customer)-[:PURCHASED]->(p:Product) RETURN c, p"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add another purchase to the graph database:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "add_purchase(test_customer, 1010, datetime.now(), connection)\n",
    "connection.close()"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This code will save the script we will run in Neo4J Browser:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Overwriting cypher/get_cust_and_prod.cql\n"
     ]
    }
   ],
   "source": [
    "%%writefile cypher/get_cust_and_prod.cql\n",
    "MATCH (c:Customer)-[purchase:PURCHASED]->(p:Product) \n",
    "RETURN c.name, p.name, purchase.datetime"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We will purge out database data with the below Cypher that will be execute in the Neo4J Browser:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Overwriting cypher/purge_data.cql\n"
     ]
    }
   ],
   "source": [
    "%%writefile cypher/purge_data.cql\n",
    "MATCH (c:Customer) DETACH DELETE c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_product_ids(connection):\n",
    "\tquery = 'MATCH (p:Product) RETURN p.productID as productID'\n",
    "\tresult = connection.query(query).data()\n",
    "\tresult = [product['productID'] for product in result]\n",
    "\treturn result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011, 1012, 1013, 1014, 1015, 1016, 1017, 1018, 1019, 1020, 1021, 1022, 1023, 1024, 1025, 1026, 1027]\n",
      "27\n"
     ]
    }
   ],
   "source": [
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "product_ids = get_product_ids(connection)\n",
    "connection.close()\n",
    "print(product_ids)\n",
    "print(len(product_ids))"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Generate lots of customers:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "customers = [Customer(customerID) for customerID in range(10000, 10100)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "for customer in customers:\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    add_customer(customer, connection)\n",
    "    connection.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The customer ID is: 10000\n",
      "Custoner Name is: Gary Nielsen\n",
      "Customer address: 1965 Kelly Field Apt. 094\n",
      "Jonesberg, FM 20102\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10001\n",
      "Custoner Name is: Sarah Villanueva\n",
      "Customer address: PSC 8684, Box 8339\n",
      "APO AA 76482\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10002\n",
      "Custoner Name is: Johnathan Davidson\n",
      "Customer address: 59179 Bruce Gardens Apt. 413\n",
      "Lauramouth, NE 08652\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10003\n",
      "Custoner Name is: Charles Wolfe\n",
      "Customer address: 13991 Davis Village\n",
      "North Catherineborough, HI 94625\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10004\n",
      "Custoner Name is: Daniel Owen\n",
      "Customer address: USS Stephens\n",
      "FPO AP 13804\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10005\n",
      "Custoner Name is: Andrea Jones\n",
      "Customer address: 08709 Holly Lock Apt. 457\n",
      "Lake Emily, WI 08109\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10006\n",
      "Custoner Name is: Brooke Martin\n",
      "Customer address: 720 Maldonado Port\n",
      "Deborahfurt, MP 86696\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10007\n",
      "Custoner Name is: Justin Smith\n",
      "Customer address: 084 John Orchard Suite 945\n",
      "Lake Kyle, WA 54819\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10008\n",
      "Custoner Name is: Angela Wheeler\n",
      "Customer address: 37696 Richard Squares\n",
      "Bartonton, GA 58874\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10009\n",
      "Custoner Name is: Michael Griffin\n",
      "Customer address: 75470 Lopez Roads\n",
      "Port Jessicatown, MO 89435\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10010\n",
      "Custoner Name is: Aaron Smith\n",
      "Customer address: 19344 Craig Walk\n",
      "Burtontown, KY 59873\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10011\n",
      "Custoner Name is: Ashley Scott\n",
      "Customer address: 24000 Erin Point Suite 590\n",
      "Josephmouth, SC 57575\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10012\n",
      "Custoner Name is: Joshua Clark\n",
      "Customer address: 24555 Matthew River\n",
      "North Josephberg, OR 38450\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10013\n",
      "Custoner Name is: William Anderson\n",
      "Customer address: 42814 Houston Hills\n",
      "Rodriguezside, PW 63569\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10014\n",
      "Custoner Name is: Ryan Cherry\n",
      "Customer address: 76045 Samantha Road Suite 111\n",
      "Lake Jeffrey, MS 01530\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10015\n",
      "Custoner Name is: Justin Roberts\n",
      "Customer address: PSC 9361, Box 5349\n",
      "APO AE 57022\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10016\n",
      "Custoner Name is: Brian Short\n",
      "Customer address: 731 Sanders Fords\n",
      "Port Jasonberg, CT 26449\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10017\n",
      "Custoner Name is: Isaiah Wilcox\n",
      "Customer address: 96687 Bass Parks Apt. 893\n",
      "West Janicemouth, GU 42683\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10018\n",
      "Custoner Name is: Charles Scott\n",
      "Customer address: 471 Zachary Canyon Apt. 320\n",
      "Alexismouth, MA 21562\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10019\n",
      "Custoner Name is: Sheila Murray\n",
      "Customer address: 809 Erika Valley Apt. 634\n",
      "Petersenfort, PR 51431\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10020\n",
      "Custoner Name is: Cynthia Hancock\n",
      "Customer address: 248 Cook Park\n",
      "Sherriport, WI 53987\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10021\n",
      "Custoner Name is: James Martin\n",
      "Customer address: USNS Mitchell\n",
      "FPO AA 07779\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10022\n",
      "Custoner Name is: Karen Thomas\n",
      "Customer address: 256 Cheryl Lights\n",
      "Williamsfort, WI 20341\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10023\n",
      "Custoner Name is: Kyle Anderson\n",
      "Customer address: 67109 Mendez Junction Apt. 942\n",
      "Lloydville, NC 25290\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10024\n",
      "Custoner Name is: James Watson\n",
      "Customer address: 100 Scott Burg Apt. 318\n",
      "Hunterville, FL 56333\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10025\n",
      "Custoner Name is: Jennifer Miller\n",
      "Customer address: 62076 Johnson Way\n",
      "Jenniferland, MI 09719\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10026\n",
      "Custoner Name is: Michael Reed\n",
      "Customer address: 1923 Jamie Spring\n",
      "Lake Adrianstad, UT 03731\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10027\n",
      "Custoner Name is: Crystal Thomas\n",
      "Customer address: 4203 Rogers Highway Suite 852\n",
      "North Amandaport, GA 49861\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10028\n",
      "Custoner Name is: Theresa Brock\n",
      "Customer address: 24560 Carolyn Lock\n",
      "Lake Charleschester, ME 72692\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10029\n",
      "Custoner Name is: Timothy Garza\n",
      "Customer address: 37580 Ortiz Mall Suite 735\n",
      "Stephanieland, HI 14737\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10030\n",
      "Custoner Name is: Justin Watts\n",
      "Customer address: 2662 Susan Junctions Apt. 571\n",
      "Fischerport, AL 92119\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10031\n",
      "Custoner Name is: Joel Robinson\n",
      "Customer address: 926 Davis Parks Apt. 864\n",
      "North Josephton, AL 34130\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10032\n",
      "Custoner Name is: Steve Mckinney\n",
      "Customer address: 4391 Chad Greens Suite 851\n",
      "Port Frank, MT 38471\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10033\n",
      "Custoner Name is: Chad Mills\n",
      "Customer address: 8644 Watson Road\n",
      "East David, DE 50495\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10034\n",
      "Custoner Name is: John Castro\n",
      "Customer address: 637 Neal Island Suite 074\n",
      "Lake Tyler, FM 81915\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10035\n",
      "Custoner Name is: Henry Myers\n",
      "Customer address: Unit 8116 Box 0501\n",
      "DPO AP 00991\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10036\n",
      "Custoner Name is: Dr. Melissa Acosta MD\n",
      "Customer address: 16756 Mark Rue Suite 272\n",
      "Davidburgh, NV 46267\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10037\n",
      "Custoner Name is: Jasmine Roman\n",
      "Customer address: 73906 Jim Corner\n",
      "West Brian, SC 89301\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10038\n",
      "Custoner Name is: Leslie Salazar\n",
      "Customer address: 6708 Carpenter Overpass Suite 735\n",
      "Bobbyton, GA 46350\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10039\n",
      "Custoner Name is: Matthew Taylor\n",
      "Customer address: 683 Lee Rest\n",
      "New Nicolemouth, MD 70742\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10040\n",
      "Custoner Name is: Frederick Johnson\n",
      "Customer address: 38533 Chambers Street Suite 486\n",
      "Timothybury, AZ 40584\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10041\n",
      "Custoner Name is: Andrea Murray\n",
      "Customer address: 7771 Christopher Courts\n",
      "South Nicole, IL 58256\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10042\n",
      "Custoner Name is: Sabrina Hansen\n",
      "Customer address: 23732 Michael Island Suite 184\n",
      "Lake Kenneth, NV 67876\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10043\n",
      "Custoner Name is: Kimberly Green\n",
      "Customer address: 126 Jeffery Street\n",
      "Lake Amandachester, PR 07024\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10044\n",
      "Custoner Name is: Matthew Wilson\n",
      "Customer address: 84331 Leonard Fort Suite 749\n",
      "East Lisa, OH 66672\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10045\n",
      "Custoner Name is: Kevin Johnson\n",
      "Customer address: 28123 Hudson Square Apt. 323\n",
      "Gomezshire, DC 82943\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10046\n",
      "Custoner Name is: Dr. Luis Johnson MD\n",
      "Customer address: 38277 Padilla Common Suite 296\n",
      "Port Leslie, LA 50844\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10047\n",
      "Custoner Name is: Christine Edwards\n",
      "Customer address: 7345 Kevin Knolls\n",
      "Lake Crystalstad, AK 64871\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10048\n",
      "Custoner Name is: Allison Williams\n",
      "Customer address: 05623 Graham Knolls Suite 256\n",
      "Smithview, ND 70144\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10049\n",
      "Custoner Name is: Veronica Bush\n",
      "Customer address: 6208 Christy Shore\n",
      "North Mark, MP 23605\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10050\n",
      "Custoner Name is: Alex Drake\n",
      "Customer address: 169 Christine Mount\n",
      "New Carolyn, KS 45098\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10051\n",
      "Custoner Name is: Morgan Johnson\n",
      "Customer address: USS Crawford\n",
      "FPO AA 38870\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10052\n",
      "Custoner Name is: Judith Romero\n",
      "Customer address: 4760 Moreno Heights Suite 089\n",
      "Sarahton, NH 52282\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10053\n",
      "Custoner Name is: Jennifer Crawford\n",
      "Customer address: 9438 Hughes Village\n",
      "Jasonshire, MA 32305\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10054\n",
      "Custoner Name is: Michelle Maldonado\n",
      "Customer address: 0909 Stephanie Lake\n",
      "Conniemouth, NM 53409\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10055\n",
      "Custoner Name is: Victoria Smith\n",
      "Customer address: 2507 Burgess Field\n",
      "New Sharonview, MP 23285\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10056\n",
      "Custoner Name is: Amy Fowler\n",
      "Customer address: 4440 Osborne Viaduct Suite 488\n",
      "Veronicaborough, VT 57084\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10057\n",
      "Custoner Name is: Sarah Brady\n",
      "Customer address: 7086 Rachel Lake Apt. 357\n",
      "Lake Jillshire, MH 32230\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10058\n",
      "Custoner Name is: Tony House\n",
      "Customer address: 78132 Mclean Meadow Suite 446\n",
      "Chelsealand, ME 04450\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10059\n",
      "Custoner Name is: Phillip Harris MD\n",
      "Customer address: 097 Gallegos Crossroad Suite 506\n",
      "Mccallberg, AZ 11181\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10060\n",
      "Custoner Name is: Hannah Smith\n",
      "Customer address: 870 Hebert Vista\n",
      "West Philipberg, WV 83806\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10061\n",
      "Custoner Name is: Michael Larson\n",
      "Customer address: 022 Renee Squares Apt. 808\n",
      "Herringstad, AS 77293\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10062\n",
      "Custoner Name is: Angela Thompson\n",
      "Customer address: 4487 Katherine Mission Apt. 092\n",
      "Port Leslieland, ID 85488\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10063\n",
      "Custoner Name is: Lisa Burnett\n",
      "Customer address: 278 Amy View Suite 011\n",
      "Lawsonshire, NV 44515\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10064\n",
      "Custoner Name is: Kayla Archer\n",
      "Customer address: 50220 Blackwell Fields\n",
      "South Deannaport, WY 51555\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10065\n",
      "Custoner Name is: Lindsay Bauer\n",
      "Customer address: 0759 Chambers Port\n",
      "Gutierreztown, NH 35123\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10066\n",
      "Custoner Name is: James Howard\n",
      "Customer address: 26905 Gibbs Summit Suite 710\n",
      "Gibbsview, AK 85435\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10067\n",
      "Custoner Name is: Sara Miller\n",
      "Customer address: 0284 Aaron Junction\n",
      "New Heather, GA 23388\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10068\n",
      "Custoner Name is: Caitlin Frazier\n",
      "Customer address: USNV Dougherty\n",
      "FPO AA 82530\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10069\n",
      "Custoner Name is: Amanda Allen\n",
      "Customer address: 53267 Walter Dam\n",
      "Cunninghamtown, GA 77001\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10070\n",
      "Custoner Name is: James Solis\n",
      "Customer address: Unit 0058 Box 0001\n",
      "DPO AP 80648\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10071\n",
      "Custoner Name is: Christian Buchanan\n",
      "Customer address: 9532 Dixon Place Suite 126\n",
      "Tammychester, MH 57653\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10072\n",
      "Custoner Name is: James Hendricks\n",
      "Customer address: 9144 Daniels Rapids Suite 340\n",
      "Michellefurt, SC 14481\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10073\n",
      "Custoner Name is: Sarah Thomas\n",
      "Customer address: 661 Munoz Estates Apt. 576\n",
      "New Samantha, VI 37687\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10074\n",
      "Custoner Name is: Ashley Richardson\n",
      "Customer address: 8034 Jennifer Islands Suite 604\n",
      "Johnsonchester, KY 49674\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10075\n",
      "Custoner Name is: Hannah Anderson\n",
      "Customer address: 69671 Kimberly Plains\n",
      "East Eric, GA 30418\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10076\n",
      "Custoner Name is: Chad Snyder\n",
      "Customer address: PSC 9451, Box 6425\n",
      "APO AP 66241\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10077\n",
      "Custoner Name is: Kim Thomas\n",
      "Customer address: 65678 Oconnell Lodge Apt. 220\n",
      "Lake Kimberlyborough, PA 84950\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10078\n",
      "Custoner Name is: Kayla Adams\n",
      "Customer address: 1001 Roth Orchard\n",
      "Danielmouth, MN 77080\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10079\n",
      "Custoner Name is: Mary Burnett\n",
      "Customer address: 818 Anthony Row\n",
      "New Robert, TN 27774\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10080\n",
      "Custoner Name is: Michael Baker\n",
      "Customer address: 79061 Cook Parkways Suite 079\n",
      "West Marissafort, OH 85040\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10081\n",
      "Custoner Name is: Derek Hall\n",
      "Customer address: 271 Timothy Port Suite 814\n",
      "Hallville, LA 18991\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10082\n",
      "Custoner Name is: Brandon Barrett\n",
      "Customer address: 830 Michelle Point\n",
      "Kleinville, NJ 73841\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10083\n",
      "Custoner Name is: Richard Brennan\n",
      "Customer address: 74430 Kelly Pass\n",
      "Christopherport, OK 55851\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10084\n",
      "Custoner Name is: Jacob James\n",
      "Customer address: 3754 Salazar Village\n",
      "South Michaelfort, IN 86508\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10085\n",
      "Custoner Name is: Lynn Howard\n",
      "Customer address: 417 Martinez Drives Suite 325\n",
      "Perezfurt, MS 61425\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10086\n",
      "Custoner Name is: Veronica Bray\n",
      "Customer address: 684 Hall Path\n",
      "North Thomasfurt, MH 30303\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10087\n",
      "Custoner Name is: Jessica Williams\n",
      "Customer address: 43521 Laura Lakes Apt. 300\n",
      "Nicholsberg, DE 79753\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10088\n",
      "Custoner Name is: Susan Miller\n",
      "Customer address: 961 Sara Forks\n",
      "Reyestown, NE 28039\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10089\n",
      "Custoner Name is: Preston Gilbert\n",
      "Customer address: 557 Caitlin Course Suite 114\n",
      "Lake Donaldberg, MS 27644\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10090\n",
      "Custoner Name is: Mary Harris\n",
      "Customer address: 171 Harrison Motorway\n",
      "Davidview, MS 10796\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10091\n",
      "Custoner Name is: Gabriela Short\n",
      "Customer address: 7607 Andrea Track\n",
      "Walkerbury, KS 63052\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10092\n",
      "Custoner Name is: Darren Campbell\n",
      "Customer address: 134 Sophia Drives\n",
      "Benjaminburgh, WI 61921\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10093\n",
      "Custoner Name is: Cody Crawford\n",
      "Customer address: 8352 Hernandez Spurs\n",
      "Nolanshire, IL 78890\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10094\n",
      "Custoner Name is: David Stein\n",
      "Customer address: 00237 Donna Coves\n",
      "Middletonport, FM 90026\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10095\n",
      "Custoner Name is: Michael Martin\n",
      "Customer address: 767 Singleton Mountain Apt. 231\n",
      "South Stephanie, VT 71357\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10096\n",
      "Custoner Name is: Jacob Williams\n",
      "Customer address: 9968 Cynthia Skyway\n",
      "New Dawn, NM 40953\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10097\n",
      "Custoner Name is: Joshua Miller\n",
      "Customer address: Unit 7036 Box 9541\n",
      "DPO AP 03546\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10098\n",
      "Custoner Name is: Cynthia Faulkner\n",
      "Customer address: 74197 Humphrey Forges Suite 685\n",
      "Port Brittany, CO 06269\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n",
      "The customer ID is: 10099\n",
      "Custoner Name is: Mark Elliott\n",
      "Customer address: 5601 Lawson Dale Apt. 016\n",
      "North Crystal, KS 50871\n",
      "Created on: 19/10/2023-16:34:13 \n",
      "----------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "import random\n",
    "\n",
    "for customer in customers:\n",
    "    # Print out the customer and add a line print for \n",
    "    print(customer, '\\n----------------------------------------------------')\n",
    "    product = random.choice(product_ids)\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    add_purchase(customer, product, datetime.now(), connection)\n",
    "    connection.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "from time import sleep\n",
    "sleep(1)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Making Recommendations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def rec_by_brand(c, connection):\n",
    "    query = f'MATCH (c:Customer {{customerID: toInteger({c.customerID})}})' \\\n",
    "            '-[:PURCHASED]->(p:Product)' \\\n",
    "            'MATCH (p)-[:HAS_BRAND]->(b:Brand)' \\\n",
    "            'MATCH (b)<-[:HAS_BRAND]-(r:Product)' \\\n",
    "            'WHERE NOT (c)-[:PURCHASED]->(r)' \\\n",
    "            'RETURN DISTINCT r.productID as productID'\n",
    "    \n",
    "    result = connection.query(query).data()\n",
    "    result = [product['productID'] for product in result]\n",
    "\n",
    "\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "print(connection)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "brand_recommendations = rec_by_brand(customers[10], connection)\n",
    "connection.close()\n",
    "print(brand_recommendations)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Use the Cypher in Neo4J Browser to get the results:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%writefile cypher/cust_brand_prod.cql\n",
    "MATCH (c:Customer {customerID:10010})-[:PURCHASED]->(p:Product)\n",
    "MATCH (p)-[:HAS_BRAND]->(b:Brand)\n",
    "MATCH (b)<-[:HAS_BRAND]-(r:Product)\n",
    "WHERE NOT (c)-[:PURCHASED]->(r)\n",
    "RETURN c, p, b, r"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for customer in customers:\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    brand_recommendations = rec_by_brand(customer, connection)\n",
    "    connection.close()\n",
    "    if len(brand_recommendations) != 0:\n",
    "        product = random.choice(brand_recommendations)\n",
    "        connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "        add_purchase(customer, product, datetime.now(), connection)\n",
    "        connection.close()\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Execute cypher to see if this has worked correctly:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%writefile cypher/distinct_product_match.cql\n",
    "MATCH (c:Customer {customerID:10010})-[:PURCHASED]->(p:Product)\n",
    "MATCH (p)-[:HAS_TYPE]->(st:Type)\n",
    "MATCH (p)-[:HAS_BRAND]->(b:Brand)\n",
    "MATCH (b)<-[:HAS_BRAND]-(r:Product)\n",
    "WHERE NOT (c)-[:PURCHASED]->(r) AND (r)-[:HAS_TYPE]->(st)\n",
    "RETURN DISTINCT r\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Drawing on other customers purchases"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def rec_by_copurchase(c, connection):\n",
    "    query = f'MATCH (c:Customer {{customerID: toInteger({c.customerID})}})' \\\n",
    "            '-[:PURCHASED]->(p:Product)' \\\n",
    "            'MATCH (p)<-[:PURCHASED]-(c2:Customer)' \\\n",
    "            'WHERE c2 <> c ' \\\n",
    "            'MATCH (c2)-[:PURCHASED]->(r:Product)' \\\n",
    "            'WHERE p <> r ' \\\n",
    "            'RETURN DISTINCT r.productID as productID'\n",
    "    result = connection.query(query).data()\n",
    "    result = [product['productID'] for product in result]\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "copurchase_recommendations = rec_by_copurchase(customers[10], connection)\n",
    "connection.close()\n",
    "print(copurchase_recommendations)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for customer in customers:\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    copurchase_recommendations = rec_by_copurchase(customer, connection)\n",
    "    connection.close()\n",
    "    if len(copurchase_recommendations) != 0:\n",
    "        product = random.choice(copurchase_recommendations)\n",
    "        connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "        add_purchase(customer, product, datetime.now(), connection)\n",
    "        connection.close()\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Using similarity scores to recommend products"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_customer_purchases(c_id, connection):\n",
    "    query = f'MATCH (c:Customer {{customerID: toInteger({c_id})}})' \\\n",
    "            '-[:PURCHASED]->(p:Product)' \\\n",
    "            'RETURN DISTINCT p.productID as productID'\n",
    "    result = connection.query(query).data()\n",
    "    result = [product['productID'] for product in result]\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "purchases = get_customer_purchases(customers[10].customerID, connection)\n",
    "connection.close()\n",
    "print(purchases)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This code to be run in `Neo4J Browser`:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%writefile cypher/cust_purchases.cql\n",
    "MATCH (c:Customer {customerID:10010})-[:PURCHASED]-(p:Product)\n",
    "RETURN DISTINCT p.productID as productID"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "all_purchases = {customer.customerID: get_customer_purchases(customer.customerID, connection) \n",
    "                 for customer in customers}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "print(all_purchases)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def jaccard_similarity(list1, list2):\n",
    "    set1 = set(list1)\n",
    "    set2 = set(list2)\n",
    "    intersection = set1.intersection(set2)\n",
    "    union = set1.union(set2)\n",
    "    jaccard = len(intersection) / len(union)\n",
    "    return jaccard"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "list1 = [1, 2, 3, 4]\n",
    "list2 = [5, 6, 7, 8]\n",
    "list3 = [1, 2]\n",
    "assert jaccard_similarity(list1, list1) == 1\n",
    "assert jaccard_similarity(list1, list2) == 0\n",
    "assert jaccard_similarity(list1, list3) == 0.5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import itertools\n",
    "customer_ids = list(all_purchases.keys())\n",
    "print(customer_ids)\n",
    "customer_pairs = list(itertools.combinations(customer_ids, 2))\n",
    "print(customer_pairs[:10])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "similarity = {pair: jaccard_similarity(all_purchases[pair[0]], all_purchases[pair[1]]) for pair in customer_pairs}\n",
    "print(similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from collections import Counter\n",
    "grouped_similiarities = Counter(similarity.values())\n",
    "print(grouped_similiarities)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_purchase_id(c_id, productID, time, connection):\n",
    "\tquery = f'MATCH (c:Customer {{customerID: toInteger({c_id})}}) ' \\\n",
    "\t\t\tf'MATCH (p:Product {{productID: toInteger({productID})}}) ' \\\n",
    "\t\t\tf'MERGE (c)-[:PURCHASED {{datetime:\"{time}\"}}]->(p)'\n",
    "\tconnection.query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "threshold = 0.7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def rec_by_similarity(c1, c2, threshold, connection):\n",
    "    p1 = get_customer_purchases(c1, connection)\n",
    "    p2 = get_customer_purchases(c2, connection)\n",
    "    similarity = jaccard_similarity(p1, p2)\n",
    "    if similarity >= threshold and similarity != 1:\n",
    "        p1_recs = [p for p in p2 if p not in p1]\n",
    "        p2_recs = [p for p in p1 if p not in p2]\n",
    "        for p in p1_recs:\n",
    "            add_purchase_id(c1, p, datetime.now(), connection)\n",
    "        for p in p2_recs:\n",
    "            add_purchase_id(c2, p, datetime.now(), connection)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for pair in customer_pairs:\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    rec_by_similarity(pair[0], pair[1], 0.7, connection)\n",
    "    connection.close()"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Complete Python script"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%writefile pipeline_dev.py\n",
    "from faker import Faker\n",
    "from datetime import datetime\n",
    "from graphtastic.database.neo4j import Neo4jConnect\n",
    "import random\n",
    "\n",
    "# Fake some data\n",
    "fake = Faker()\n",
    "Faker.seed(0)\n",
    "# Get faker atrributes\n",
    "name = fake.name()\n",
    "address = fake.address()\n",
    "print(name)\n",
    "print(address)\n",
    "\n",
    "# Create a class we will use to generate new customers\n",
    "class Customer:\n",
    "\tdef __init__(self, customerID):\n",
    "\t\tself.customerID = customerID\n",
    "\t\tself.name = fake.name()\n",
    "\t\tself.address = fake.address()\n",
    "\t\tself.datetime = datetime.now().strftime(\"%d/%m/%Y-%H:%M:%S\")\n",
    "\n",
    "\t# Custom string override (dunder method) to print when print on new customer class is instantiated\n",
    "\tdef __str__(self):\n",
    "\t\treturn f'The customer ID is: {self.customerID}\\nCustoner Name is: {self.name}\\nCustomer address: {self.address}\\nCreated on: {self.datetime}'\n",
    "   \n",
    "\n",
    "# Instantiate customer\n",
    "new_customer = Customer(customerID=9999)\n",
    "print(new_customer)\n",
    "\n",
    "# Create add customer function\n",
    "def add_customer(c, connection):\n",
    "    query = f'MERGE (:Customer {{customerID: toInteger({c.customerID}), ' \\\n",
    "    \t\tf'name: \"{c.name}\", ' \\\n",
    "    \t\tf'address: \"{c.address}\"}})'\n",
    "    connection.query(query)\n",
    "\n",
    "# Create customer in Neo4J\n",
    "test_customer = Customer(9999)\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "add_customer(test_customer, connection)\n",
    "connection.close()\n",
    "\n",
    "# Create function to add a purchase to Neo4J\n",
    "def add_purchase(c, productID, time, connection):\n",
    "\tquery = f'MATCH (c:Customer {{customerID: toInteger({c.customerID})}}) ' \\\n",
    "\t\t\tf'MATCH (p:Product {{productID: toInteger({productID})}}) ' \\\n",
    "\t\t\tf'MERGE (c)-[:PURCHASED {{datetime:\"{time}\"}}]->(p)'\n",
    "\tconnection.query(query)\n",
    "\n",
    "# Use add purchase to add purchases for our test customer\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "add_purchase(test_customer, 1010, datetime.now(), connection)\n",
    "connection.close()\n",
    "\n",
    "# Add another purchase\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "add_purchase(test_customer, 1010, datetime.now(), connection)\n",
    "connection.close()\n",
    "\n",
    "# Create function to get product ids\n",
    "def get_product_ids(connection):\n",
    "\tquery = 'MATCH (p:Product) RETURN p.productID as productID'\n",
    "\tresult = connection.query(query).data()\n",
    "\tresult = [product['productID'] for product in result]\n",
    "\treturn result\n",
    "\n",
    "# Get product IDS from Neo4J\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "product_ids = get_product_ids(connection)\n",
    "connection.close()\n",
    "print(product_ids)\n",
    "print(len(product_ids))\n",
    "\n",
    "# Generate lots of customers\n",
    "customers = [Customer(customerID) for customerID in range(10000, 10100)]\n",
    "for customer in customers:\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    add_customer(customer, connection)\n",
    "    connection.close()\n",
    "\n",
    "# Create purchases at random for our customers\n",
    "for customer in customers:\n",
    "    # Print out the customer and add a line print for \n",
    "    print(customer, '\\n----------------------------------------------------')\n",
    "    product = random.choice(product_ids)\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    add_purchase(customer, product, datetime.now(), connection)\n",
    "    connection.close()\n",
    "\n",
    "# MAKING RECOMMENDATIONS\n",
    "def rec_by_brand(c, connection):\n",
    "    query = f'MATCH (c:Customer {{customerID: toInteger({c.customerID})}})' \\\n",
    "            '-[:PURCHASED]->(p:Product)' \\\n",
    "            'MATCH (p)-[:HAS_BRAND]->(b:Brand)' \\\n",
    "            'MATCH (b)<-[:HAS_BRAND]-(r:Product)' \\\n",
    "            'WHERE NOT (c)-[:PURCHASED]->(r)' \\\n",
    "            'RETURN DISTINCT r.productID as productID'\n",
    "    \n",
    "    result = connection.query(query).data()\n",
    "    result = [product['productID'] for product in result]\n",
    "    return result\n",
    "\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "print(connection)\n",
    "\n",
    "# Use function to get recommendations by brand\n",
    "brand_recommendations = rec_by_brand(customers[10], connection)\n",
    "connection.close()\n",
    "print(brand_recommendations)\n",
    "\n",
    "for customer in customers:\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    brand_recommendations = rec_by_brand(customer, connection)\n",
    "    connection.close()\n",
    "    if len(brand_recommendations) != 0:\n",
    "        product = random.choice(brand_recommendations)\n",
    "        connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "        add_purchase(customer, product, datetime.now(), connection)\n",
    "        connection.close()\n",
    "\n",
    "# Drawing on other customers purchases\n",
    "def rec_by_copurchase(c, connection):\n",
    "    query = f'MATCH (c:Customer {{customerID: toInteger({c.customerID})}})' \\\n",
    "            '-[:PURCHASED]->(p:Product)' \\\n",
    "            'MATCH (p)<-[:PURCHASED]-(c2:Customer)' \\\n",
    "            'WHERE c2 <> c ' \\\n",
    "            'MATCH (c2)-[:PURCHASED]->(r:Product)' \\\n",
    "            'WHERE p <> r ' \\\n",
    "            'RETURN DISTINCT r.productID as productID'\n",
    "    result = connection.query(query).data()\n",
    "    result = [product['productID'] for product in result]\n",
    "    return result\n",
    "\n",
    "# Look at recommending products based on other customers recommendations\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "copurchase_recommendations = rec_by_copurchase(customers[10], connection)\n",
    "connection.close()\n",
    "print(copurchase_recommendations)\n",
    "\n",
    "for customer in customers:\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    copurchase_recommendations = rec_by_copurchase(customer, connection)\n",
    "    connection.close()\n",
    "    if len(copurchase_recommendations) != 0:\n",
    "        product = random.choice(copurchase_recommendations)\n",
    "        connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "        add_purchase(customer, product, datetime.now(), connection)\n",
    "        connection.close()\n",
    "\n",
    "# Use similarity scores to recommend products\n",
    "def get_customer_purchases(c_id, connection):\n",
    "    query = f'MATCH (c:Customer {{customerID: toInteger({c_id})}})' \\\n",
    "            '-[:PURCHASED]->(p:Product)' \\\n",
    "            'RETURN DISTINCT p.productID as productID'\n",
    "    result = connection.query(query).data()\n",
    "    result = [product['productID'] for product in result]\n",
    "    return result\n",
    "\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "purchases = get_customer_purchases(customers[10].customerID, connection)\n",
    "connection.close()\n",
    "print(purchases)\n",
    "\n",
    "connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "all_purchases = {customer.customerID: get_customer_purchases(customer.customerID, connection) \n",
    "                 for customer in customers}\n",
    "\n",
    "print(all_purchases)\n",
    "\n",
    "# Create Jaccard similarity to look at similar purchases\n",
    "def jaccard_similarity(list1, list2):\n",
    "    set1 = set(list1)\n",
    "    set2 = set(list2)\n",
    "    intersection = set1.intersection(set2)\n",
    "    union = set1.union(set2)\n",
    "    jaccard = len(intersection) / len(union)\n",
    "    return jaccard\n",
    "\n",
    "list1 = [1, 2, 3, 4]\n",
    "list2 = [5, 6, 7, 8]\n",
    "list3 = [1, 2]\n",
    "assert jaccard_similarity(list1, list1) == 1\n",
    "assert jaccard_similarity(list1, list2) == 0\n",
    "assert jaccard_similarity(list1, list3) == 0.5\n",
    "\n",
    "import itertools\n",
    "customer_ids = list(all_purchases.keys())\n",
    "print(customer_ids)\n",
    "customer_pairs = list(itertools.combinations(customer_ids, 2))\n",
    "print(customer_pairs[:10])\n",
    "\n",
    "#Get similarity\n",
    "similarity = {pair: jaccard_similarity(all_purchases[pair[0]], all_purchases[pair[1]]) for pair in customer_pairs}\n",
    "print(similarity)\n",
    "\n",
    "from collections import Counter\n",
    "grouped_similiarities = Counter(similarity.values())\n",
    "print(grouped_similiarities)\n",
    "\n",
    "def add_purchase_id(c_id, productID, time, connection):\n",
    "\tquery = f'MATCH (c:Customer {{customerID: toInteger({c_id})}}) ' \\\n",
    "\t\t\tf'MATCH (p:Product {{productID: toInteger({productID})}}) ' \\\n",
    "\t\t\tf'MERGE (c)-[:PURCHASED {{datetime:\"{time}\"}}]->(p)'\n",
    "\tconnection.query(query)\n",
    "\n",
    "threshold = 0.7\n",
    "\n",
    "def rec_by_similarity(c1, c2, threshold, connection):\n",
    "    p1 = get_customer_purchases(c1, connection)\n",
    "    p2 = get_customer_purchases(c2, connection)\n",
    "    similarity = jaccard_similarity(p1, p2)\n",
    "    if similarity >= threshold and similarity != 1:\n",
    "        p1_recs = [p for p in p2 if p not in p1]\n",
    "        p2_recs = [p for p in p1 if p not in p2]\n",
    "        for p in p1_recs:\n",
    "            add_purchase_id(c1, p, datetime.now(), connection)\n",
    "        for p in p2_recs:\n",
    "            add_purchase_id(c2, p, datetime.now(), connection)\n",
    "\n",
    "for pair in customer_pairs:\n",
    "    connection = Neo4jConnect('bolt://localhost:7687', 'admin', 'testpython')\n",
    "    rec_by_similarity(pair[0], pair[1], 0.7, connection)\n",
    "    connection.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "graph-book",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.1"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "0e962125a6bade716827c7cd07d3b7c9b717838910a5075eb32d8b321480d4bb"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
